Repository: NationalTalentS/github-updater-translations
Catalog: languages/github-updater-*.po
Languages: ar, pt_pt, ru_ru, sv_se

source: Activated as mu-plugin
ar: تفعيل كإضافة تلقائية
pt_pt: Activado como um plugin obrigatório
ru_ru: Активировать в mu-плагина
sv_se: Aktiverat som mu-tillägg

source: Bitbucket Private Settings
ar: إعدادت Bitbucket الخاصة
pt_pt: Definições privadas do Bitbucket
ru_ru: BitBucket частные параметры
sv_se: Privata inställningar för Bitbucket

source: Bitbucket Username
ar: اسم المستخدم (Bitbucket )
pt_pt: Utilizador do Bitbucket
ru_ru: Bitbucket Имя пользователя
sv_se: Användarnamn för Bitbucket

source: Bitbucket Password
ar: كلمة المرور (Bitbucket )
pt_pt: Senha do Bitbucket
ru_ru: BitBucket пароль
sv_se: Lösenord för Bitbucket

source: Bitbucket Private Repositories
ar: مستودعات Bitbucket الخاصة
pt_pt: Repositórios privados do Bitbucket
ru_ru: BitBucket частных хранилищ
sv_se: Privata Bitbucket-repos

source: Check box if private repository. Leave unchecked for public repositories.
ar: قم بالاختيار إذا كان المستودع خاص , قم بتركه من أجل المستودعات العامة
pt_pt: Seleccione a opção se for um repositório privado. Não seleccione para repositórios públicos.
ru_ru: Флажок, если частные хранилища. Не устанавливайте флажок для государственных хранилищ.
sv_se: Kryssa i boxen för privata repos. Lämna okryssad för publika repos.

source: Enter your personal Bitbucket username and password.
ar: أدخل اسم المستخدم و كلمة السر لحساب Bitbucket الخاص بك
pt_pt: Insira o seu nome de utilizador e senha do Bitbucket.
ru_ru: Введите ваши личные имя пользователя и пароль от Bitbucket.
sv_se: Fyll i inloggningsinformation för ditt Bitbucket-konto.

source: Private Bitbucket Repository
ar: مستودع Bitbucket خاص
pt_pt: Repositório privado do Bitbucket
ru_ru: Приватный Bitbucket репозиторий
sv_se: Privat Bitbucket repo

source: Check for private Bitbucket repositories.
ar: تحقق من وجود مستودعات بيتبوكيت الخاصة.
pt_pt: Seleccione a opção para repositórios privados do Bitbucket.
ru_ru: Проверить наличие частных Bitbucket репозиториев.
sv_se: Kryss i för privata Bitbucket repos.

source: Enter Bitbucket username.
ar: اسم المستخدم (Bitbucket )
pt_pt: Insira o nome de utilizador do Bitbucket.
ru_ru: Введите имя пользователя Bitbucket.
sv_se: Ange användarnamn för Bitbucket.

source: Enter Bitbucket password.
ar: كلمة المرور (Bitbucket )
pt_pt: Insira a senha do Bitbucket.
ru_ru: Введите пароль Bitbucket.
sv_se: Ange lösenord för Bitbucket.

source: Bitbucket Server Private Settings
ar: إعدادات الخادم الخاص بيتبوكيت
pt_pt: Definições privadas do servidor Bitbucket
ru_ru: Параметры сервера частный BitBucket
sv_se: Privata inställningar för Bitbucket Server

source: Bitbucket Server Username
ar: اسم خادم بيتبوكيت
pt_pt: Nome de utilizador do servidor Bitbucket
ru_ru: Имя пользователя сервера BitBucket
sv_se: Användarnamn för Bitbucket Server

source: Bitbucket Server Password
ar: كلمة مرور خادم بيتبوكيت
pt_pt: Senha do servidor Bitbucket
ru_ru: Пароль сервера BitBucket
sv_se: Lösenord för Bitbucket Server

source: Bitbucket Server Private Repositories
ar: المستودعات الخاصة خادم بيتبوكيت
pt_pt: Repositórios privados do servidor Bitbucket
ru_ru: BitBucket частные сервера хранилища
sv_se: Privata repos för Bitbucket Server

source: Bitbucket Server
ar: خادم بيتبوكيت
pt_pt: Servidor Bitbucket
ru_ru: BitBucket сервера

source: GitHub Personal Access Token
ar: الرمز المميز للوصول الشخصي GitHub
pt_pt: Token de acesso do GitHub pessoal
ru_ru: Маркер доступа GitHub личного

source: GitHub.com Access Token
ar: الرمز المميز للوصول GitHub.com
pt_pt: Token de acesso do GitHub.com
ru_ru: Маркер доступа GitHub.com

source: GitHub Enterprise Access Token
ar: الرمز المميز للوصول المؤسسة GitHub
pt_pt: Token de acesso do GitHub empresarial
ru_ru: Маркер доступа GitHub предприятия

source: GitHub Private Settings
ar: إعدادت GitHub الخاصة
pt_pt: Definições privadas do GitHub
ru_ru: GitHub Private Настройки
sv_se: Privata inställningar för GitHub

source: Enter your GitHub Access Token. Leave empty for public repositories.
ar: أدخل رمز وصول GitHub . قم بتركه فارغاً من أجل المستودعات العامة
pt_pt: Insira o seu token de acesso do GitHub. Deixe em branco para repositórios públicos.
ru_ru: Введите ваш GitHub маркера доступа. Оставьте пустым для государственных хранилищ.
sv_se: Fyll i ditt GitHub Access Token. Lämna tomt för publika repos.

source: Enter your personal GitHub.com or GitHub Enterprise Access Token to avoid API access limits.
ar: أدخل شخصية GitHub.com أو GitHub المؤسسة الوصول إلى الرمز المميز لتجنب حدود الوصول إلى API.
pt_pt: Insira o seu token pessoal de acesso do GitHub.com ou do GitHub Empresarial para evitar o limite de acessos da API.
ru_ru: Введите ваш личный GitHub.com или GitHub предприятия доступа маркер во избежание ограничения доступа к API.
sv_se: Ange ditt personliga GitHub.com eller GitHub Enterprise Access Token för att undvika API-begränsningar.

source: GitHub Access Token
ar: رمز وصول GitHub
pt_pt: Token de acesso do GitHub

source: Enter GitHub Access Token for private GitHub repositories.
ar: أدخل رمز وصول GitHub من مستوعات GitHub الخاصة
pt_pt: Insira o token de acesso do GitHub para repositórios privados do GitHub.
ru_ru: Введите GitHub Access Token для приватных репозиториев GitHub.
sv_se: Ange GitHub Access Token för privata GitHub repos.

source: GitLab Personal Access Token
ar: الرمز المميز للوصول الشخصي جيتلاب
pt_pt: Token de acesso do GitLab pessoal
ru_ru: Маркер доступа личный GitLab

source: GitLab Private Settings
ar: الإعدادات الخاصة جيتلاب
pt_pt: Definições privadas do GitLab
ru_ru: GitHub Private Настройки
sv_se: Privata inställningar för GitLab

source: GitLab.com Access Token
ar: الرمز المميز للوصول GitLab.com
pt_pt: Token de acesso do GitLab.com
ru_ru: Маркер доступа GitLab.com

source: GitLab CE or GitLab Enterprise Personal Access Token
ar: جيتلاب CE أو الرمز المميز للوصول الشخصي المؤسسة جيتلاب
pt_pt: Token de acesso do GitLab CE ou GitLab empresarial
ru_ru: GitLab CE или маркер личного доступа GitLab предприятие
sv_se: GitLab CE eller GitLab Enterprise Personal Access Token

source: Enter your repository specific GitLab Access Token.
pt_pt: Insira o token de acesso específico do seu repositório do GitLab.

source: Enter your GitLab.com, GitLab CE, or GitLab Enterprise Access Token.
ar: أدخل GitLab.com، م جيتلاب، أو جيتلاب المؤسسة الوصول إلى الرمز المميز.
pt_pt: Insira o seu token de acesso do GitLab.com, GitLab CE ou GitLab empresarial.
ru_ru: Введите GitLab.com, GitLab CE или GitLab предприятия доступа маркера.
sv_se: Ange ditt GitLab.com, GitLab CE eller GitLab Enterprise Access Token.

source: GitLab Access Token
ar: الرمز المميز للوصول جيتلاب
pt_pt: Token de acesso do GitLab
ru_ru: Маркер доступа GitLab

source: Enter GitLab Access Token for private GitLab repositories.
ar: أدخل رمز وصول GitLab من مستوعات GitLab الخاصة
pt_pt: Insira o token de acesso do GitLab para repositórios privados do GitLab.
ru_ru: Введите GitLab Private Token для приватных репозиториев GitLab.
sv_se: Ange GitLab Access Token för privata GitLab repos.

source: You must set a GitLab.com, GitLab CE, or GitLab Enterprise Access Token.
ar: يجب عليك تعيين GitLab.com م جيتلاب أو جيتلاب المؤسسة الوصول إلى الرمز المميز.
pt_pt: Tem de definir um token de acesso do GitLab.com, GitLab CE ou GitLab Enterprise.
ru_ru: Вам необходимо установить GitLab.com, GitLab CE или GitLab предприятия доступа маркера.
sv_se: Du måste ange ett Access Token för GitLab.com, GitLab CE eller GitLab Enterprise.

source: Gitea Access Token
pt_pt: Token de acesso do Gitea

source: Gitea Private Settings
pt_pt: Definições privadas do Gitea

source: Enter your repository specific Gitea Access Token.
pt_pt: Insira o token de acesso específico do seu repositório do Gitea.

source: Enter your Gitea Access Token.
pt_pt: Insira o seu token de acesso do Gitea.

source: Enter Gitea Access Token for private Gitea repositories.
pt_pt: Insira o token de acesso do Gitea para repositórios privados do Gitea.

source: You must set a Gitea Access Token.
pt_pt: Tem de definir um token de acesso do Gitea.

source: There may be a problem with WP-Cron. A GitHub Updater WP-Cron event is overdue.
pt_pt: Poderá haver um problema com o WP-Cron. Existe um evento do GitHub Updater em atraso no WP-Cron.

source: Current branch is `%1$s`, try %2$sanother version%3$s
ar: الفرع الحالي هو '%1$s'، حاول %2$s سانوثير إصدار %3$s
pt_pt: O ramo actual é `%1$s`, tente %2$soutra versão%3$s
ru_ru: Текущая ветка «%1$s», попробуйте %2$sanother $ для версии %3$s
sv_se: Den aktuella branchen är `%1$s`, testa %2$sen annan version%3$s

source: Switch to branch
ar: قم بالتبديل إلى فرع
pt_pt: Mudar para o ramo
ru_ru: Переключиться на ветку
sv_se: Växla till branch

source: Switch to release
ar: قم بالتبديل إلى الإفراج عن
pt_pt: Mudar para a distribuição
ru_ru: Переход на выпуск
sv_se: Växla till release

source: No previous tags to rollback to.
ar: لا يوجد أية tags لتراجع
pt_pt: Nenhuma etiqueta anterior para poder reverter.
ru_ru: Нет предыдущих теги для отката к.
sv_se: Inga föregående taggar att gå tillbaka till.

source: Install Plugin
ar: تنصيب إضافة
pt_pt: Instalar plugin
ru_ru: Установите плагин
sv_se: Installera tillägg

source: Install Theme
ar: تنصيب موضوع
pt_pt: Instalar tema
ru_ru: Установите тему
sv_se: Installera tema

source: A repository URI is required.
ar: مطلوب مستودع URI.
pt_pt: É necessário um URI do repositório.
ru_ru: Требуется адрес репозитория (URI).
sv_se: Det krävs ett repo-URI.

source: Theme
ar: موضوع
pt_pt: Tema
ru_ru: Тема
sv_se: Tema

source: GitHub Updater Install %s
ar: تحميل %s
pt_pt: GitHub Updater instalação de %s
ru_ru: GitHub Updater Установка%s
sv_se: GitHub Updater - Installera %s

source: %s URI
ar: رابط %s
pt_pt: URI do %s

source: Repository Branch
ar: الفرع
pt_pt: Ramo do repositório
ru_ru: Ветка репозитория
sv_se: Repo branch

source: Remote Repository Host
ar: مستضيف المستودعات
pt_pt: Alojamento remoto do repositório
ru_ru: Хост удаленного репозитория
sv_se: Fjärrvärd för repo

source: URI is case sensitive.
ar: URI حساس لحالة الأحرف.
pt_pt: O URI é sensível a maiúsculas e minúsculas.
ru_ru: URI чувствителен к регистру.
sv_se: URI är skiftlägeskänsligt.

source: Enter branch name or leave empty for `master`
ar: إدخل اسم الفرع أو اتركه فارغاً لاستخدام `master`
pt_pt: Insira o nome do ramo ou deixe em branco para `master`
ru_ru: Введите имя ветки или оставьте пустым для `master`
sv_se: Fyll i ett branch-namn eller lämna tomt för att använda `master`

source: Activate
ar: تفعيل
pt_pt: Activar
ru_ru: Активировать
sv_se: Aktivera

# This refers to a network activation in a multisite installation
source: Network Enable
ar: شبكة تمكين
pt_pt: Activar na rede
sv_se: Aktivera på nätverk

source: GitHub Updater Error Code:
ar: ‏%1$s غير موجود . رمز خطأ GitHub : %2$s
pt_pt: Código de erro do GitHub Updater:
ru_ru: GitHub Updater код ошибки:
sv_se: GitHub Updater felkod:

source: There is probably an access token or password error on the GitHub Updater Settings page.
ar: ربما هناك خطأ الرمز المميز أو كلمة مرور الوصول إلى صفحة إعدادات التحديث GitHub.
pt_pt: Provavelmente existe um erro no Token de acesso ou senha na página de definições do GitHub Updater.
ru_ru: На странице Параметры обновления GitHub, вероятно ошибка маркер или пароль доступа.
sv_se: Det verkar vara fel på ett Access Token eller ett lösenord på inställningssidan för GitHub Updater.

source: View details
ar: عرض التفاصيل
pt_pt: Ver detalhes
ru_ru: Подробнее
sv_se: Visa detaljer

source: Remote Management
ar: الإدارة عن بعد
pt_pt: Gestão remota
ru_ru: Удаленное управление
sv_se: Fjärrhantering

source: Reset RESTful key
ar: إعادة تعيين مفتاح راحة
pt_pt: Redefinir chave de RESTful
ru_ru: Сбросить RESTful ключ
sv_se: Återställ RESTful key

source: Please refer to README for complete list of attributes. RESTful endpoints begin at:
ar: الرجاء الرجوع إلى الملف التمهيدي للحصول على قائمة كاملة من سمات. نقاط النهاية مريحة تبدأ في:
pt_pt: Por favor consulte o README para uma lista completa de atributos. Endpoints de RESTful a partir de:
ru_ru: Пожалуйста, обратитесь к README для полного списка атрибутов. Конечными точками rESTful начинаются:
sv_se: Vänligen läs README för en komplett lista över attribut. RESTful endpoints börjar på:

source: Use of Remote Management services may result increase some page load speeds only for `admin` level users in the dashboard.
ar: زيادة استخدام "الإدارة عن بعد" قد تؤدي خدمات بعض بسرعة تحميل الصفحة فقط للمستخدمين مستوى 'مشرف' في لوحة المعلومات.
pt_pt: A utilização de serviços de gestão remota poderá aumentar o tempo de carregamento de algumas páginas do painel de administração para utilizadores com perfil de `administrador`.
ru_ru: Использование удаленного управления, службы могут привести увеличить некоторые страницы скорости загрузки только для уровня пользователей «admin» в панели инструментов.
sv_se: Användning av fjärrhantering kan öka laddningstiderna i adminpanelen för `administratörer`.

source: Settings
ar: الإعدادت
pt_pt: Definições
ru_ru: Настройки
sv_se: Inställningar

source: GitHub Updater Settings
ar: إعدادت GitHub Updater
pt_pt: Definições do GitHub Updater
ru_ru: GitHub Updater Настройки
sv_se: Inställningar för GitHub Updater

source: Refresh Cache
ar: تحديث ذاكرة التخزين المؤقتة
pt_pt: Actualizar cache
ru_ru: Обновить кэш
sv_se: Uppdatera cache

source: Settings saved.
ar: الاعدادات سجلت
pt_pt: Definições guardadas.
ru_ru: Настройки сохранены.
sv_se: Inställningar sparade.

source: RESTful key reset.
ar: إعادة تعيين مفتاح مريح.
pt_pt: Chave de RESTful redefinida.
ru_ru: Спокойного сброса ключа.
sv_se: RESTful key återställd.

source: Cache refreshed.
ar: تحديث ذاكرة التخزين المؤقت.
pt_pt: Cache actualizada.
ru_ru: Кэш обновляется.
sv_se: Cachen uppdaterad.

source: Enable Branch Switching
ar: تمكين تبديل فرع
pt_pt: Permitir mudar ramo do plugin
ru_ru: Включить переключатель веток для плагинов
sv_se: Aktivera branch-växling

source: Check to enable branch switching from the Plugins or Themes page.
ar: تحقق من تمكين الفرع التبديل من صفحة الإضافات أو المواضيع.
pt_pt: Seleccione a opção para permitir alternar entre ramos nas páginas de plugins e de temas.
ru_ru: Проверьте, чтобы филиал, переключение на странице плагины или темы.
sv_se: Kryssa i för att aktivera branch-byte från tilläggs- och temasidan.

source: This is a private repository.
pt_pt: Este repositório é privado.

source: This repository has not connected to the API or was unable to connect.
pt_pt: Este repositório ainda não está ligado à API, ou não foi possível ligar.

source: This repository is hosted on WordPress.org.
pt_pt: Este repositório está alojado em WordPress.org.

source: Installed Plugins and Themes
ar: الإضافات المثبتة والمواضيع
pt_pt: Plugins e temas instalados
ru_ru: Установленные плагины и темы
sv_se: Installerade tillägg och teman

source: There is a new version of %s available.
ar: تتوفر نسخة جديدة من %s.
pt_pt: Está disponível uma nova versão de %s.
ru_ru: Доступна новая версия %s.
sv_se: En ny version av %s finns tillgänglig.

source: View version %s details.
ar: رؤية تفاصيل نسخة %s
pt_pt: Ver detalhes da versão %s.
ru_ru: Показать подробности версии %s.
sv_se: Visa detaljer för version %s.

source: Automatic update is unavailable for this theme.
ar: التحديث التلقائي غير متوافر لهذا الموضوع
pt_pt: Actualizações automáticas indisponíveis para este tema.
ru_ru: Автоматическое обновление недоступно для этой темы.
sv_se: Automatiska uppdateringar är inte tillgängliga för detta temat.

source: Update %s now
ar: تحديث %s الآن
pt_pt: Actualizar %s agora
ru_ru: Обновить %s
sv_se: Uppdatera %s nu

source: Choose a Version
ar: قم باختيار نسخة
pt_pt: Escolha uma versão
ru_ru: Выберите версию
sv_se: Välj en version

source: Install
ar: تنصيب
pt_pt: Instalar
ru_ru: Установить
sv_se: Installera

source: A plugin to automatically update GitHub, Bitbucket, GitLab, or Gitea hosted plugins, themes, and language packs. It also allows for remote installation of plugins or themes into WordPress.
pt_pt: Um plugin para actualizar automaticamente plugins, temas e pacotes de idiomas alojados no GitHub, Bitbucket, GitLab ou Gitea. Permite a instalação remota de plugins ou temas no WordPress.

source: GitLab
ar: جيتلاب

source: Plugin
ar: إضافة
ru_ru: Плагин
sv_se: Tillägg
